Repository: lv7777/w3c_cors
Catalog: w3c_cors-level2.tmx
Source language: en_us
Languages: ja

source: W3C maintains a public list of any patent disclosures for the WebAppSec WG and the WebApps WG made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent.
ja: W3Cは、WebAppSec WG と WebApps WG が作成した成果物に関するあらゆる開示特許の公開リストを管理する。ここには、特許開示にあたっての指示も含まれている。

source: Web applications that are not uniquely identified by specific host names, and/or mapped to specific ports, do not necessarily have a unique origin, and thus will not be able to securely utilize the mechanism defined in this specification.
ja: 一意に特定できないホスト名や、特定のポートにマッピングされていない、必ずしも一意のオリジンを持っていないウェブアプリケーションは、この仕様書で定義されている安全機構を使用することができない。

source: When parsing a header the header must be parsed per the corresponding ABNF production in the syntax section.
ja: ヘッダを解析する時、 ヘッダは 構文 セクションのABNFと一致した所ごとに解析されなければならない。

source: When one of them is empty the other is non-empty.
ja: 片方が空の時、もう片方が空ではない。

source: When part of the response to a preflight request it indicates that the actual request can include user credentials.
ja: When part of the response to a これがpreflight requestのレスポンスであった場合、 このヘッダは 実際のリクエストに に ユーザー資格情報が存在できるかどうかについて指示するものである。

source: When requests have significance other than retrieval, and when relying on the Origin header, resources must be careful to distinguish between authorizing a request (including its side-effects) and authorizing access to the representation of that resource in the response.
ja: リクエストが検索以外の意義を持ち、Origin ヘッダが信頼できる場合、リソースは認証リクエストとリソースが入っているレスポンスへのアクセスを許可の区別に気を付ける必要がある

source: When the cross-origin request algorithm is invoked, these steps must be followed:
ja: クロスオリジンリクエスト アルゴリズムが呼び出された場合、以下の手順を踏む必要がある。

source: When this specification is used for requests which have significance other than retrieval and which involve coordination between or data originating from more than two origins, (e.g. between resources enabling editing, printing and storage, each at distinct origins) requests ought to set the omit credentials flag and resources ought to perform authorization using security tokens explicitly provided in the content of the request, especially if the origins are not all mutually and completely trusted.
ja: この仕様が検索以外の意図を持ったリクエストに使用されており、2つ以上のオリジンから生成されたデータ(例:別のオリジンのリソース間で編集、印刷、保存できるなど)またはそれと同等のものが含まれている場合、リクエストはomit credentials flagを設定し、リクエストのコンテンツ内で明示的に提供されているセキュリティトークンを使用して認証をしなければならない。特にもしオリジンが相互ではなく完全に信用できない場合には。

source: Whenever the abort steps are applied, terminate the algorithm that invoked this set of steps and set the cross-origin request status to abort error.
ja: abort stepsが適用されるごとに、この一連のステップを呼び出しているアルゴリズムを終了し、cross-origin request statusをabort errorに設定する。

source: Whenever the cache and network error steps are applied, follow these steps:
ja: cache and network error steps が適用された場合、以下の手順に従う。

source: Whenever the make a request steps are applied, fetch the request URL from origin source origin using referrer source as override referrer source with the manual redirect flag set, and the block cookies flag set if the omit credentials flag is set.
ja: リクエストステップが適用されたかどうかに関係なく、manual redirect flagがセットされたリファラーソースを使用して、参照元オリジンのオリジンからリクエストURLを取得し、その後、もしomit credentials flagが設定されていた場合、ブロックcookie flagを設定します。

source: Whenever the network error steps are applied, terminate the algorithm that invoked this set of steps and set the cross-origin request status to network error.
ja: network error stepsが適用されるごとに、この一連のステップを呼び出しているアルゴリズムを終了し、cross-origin request statusをnetwork errorに設定する。

source: Whenever the redirect steps are applied, follow this set of steps:
ja: リダイレクトステップが適用されるたびに、この一連の手順に従います。

source: While a cross-origin request is progressing its associated cross-origin request status is updated.
ja: cross-origin request が進行するとともに、cross-origin request status が更新される。

source: converted to ASCII lowercase
ja: ASCII lowercaseに変換する
